{
  "sections": [
    {
      "content": "title: PlacetoPay Checkout \n Content: Página de pagos prediseñada y optimizada para aumentar la tasa de conversión de tu negocio.La solución completa para agilizar y asegurar tus pagos en línea. Con nuestra plataforma prediseñada y alojada, podrás aceptar pagos de forma rápida, segura y desde cualquier dispositivo.Puedes aceptar pagos únicos, pagos recurrentes, pagos mixtos y suscribir medios de pago. \n url: https://placetopay-docs.placetopay.ws/"
    },
    {
      "content": "title: Beneficios de Checkout \n Content: Diseño personalizadoPersonaliza la apariencia de Checkout con logotipos y colores de tu empresa. Crea una experiencia de pago única y coherente con tu marca.Múltiples idiomas y monedasAcepta pagos en diferentes idiomas y monedas para atraer a clientes de todo el mundo. Amplía tu alcance y aumenta tus oportunidades de venta.Optimizado para cualquier dispositivoNuestro checkout está diseñado para adaptarse y funcionar sin problemas en dispositivos móviles y de escritorio. Brinda una experiencia de pago optimizada, independientemente del dispositivo que utilice tu cliente.Wallet PlacetoPayCon Checkout, tus clientes pueden aprovechar nuestra billetera digital, permitiéndoles guardar y gestionar sus medios de pago de forma segura. Esto agiliza el proceso de pago y brinda una mayor comodidad al realizar transacciones futuras.Seguridad de la informaciónNos tomamos en serio la protección de los datos sensibles. PlacetoPay Checkout cumple con los estándares de seguridad de la industria, incluidos los lineamientos PCI, para garantizar la seguridad en la captura y procesamiento de la información de tarjetas.Pagos avanzadosNuestra plataforma ofrece una amplia gama de opciones de pago, incluyendo pagos con impuestos, pagos mixtos, suscripciones, cobros recurrentes y promociones. Ten el control total sobre tus transacciones y ofrece opciones flexibles a tus clientes. \n url: https://placetopay-docs.placetopay.ws/"
    },
    {
      "content": "title: Cómo aprovechar esta documentación \n Content: Esta documentación está diseñada para ayudarte a aprovechar al máximo todas las características y funcionalidades de PlacetoPay Checkout. Aquí encontrarás guías detalladas, ejemplos de uso y referencias útiles para que puedas integrar y configurar fácilmente nuestra solución de pago en tu sitio web o aplicación.¡Comienza a optimizar tus pagos en línea con PlacetoPay Checkout y brinda a tus clientes una experiencia de compra fluida y segura!InicioConoce Checkout, las ventajas que te ofrece y los métodos de integración a un alto nivel.Ver másIntegraciónConoce las capacidades de Checkout, los conceptos y flujos que debes tener en cuenta para una integración exitosa.Ver másAPIConoce en detalle los métodos HTTP disponibles, los parámetros y posibles respuestas de cada servicio.Ver más \n url: https://placetopay-docs.placetopay.ws/"
    },
    {
      "content": "title: Requisitios prévios \n Content: Para poder integrarse de manera exitosa y sin contratiempos, te recomendamos:Cuenta de PlacetopayDebes tener una cuenta activa en PlacetoPay para acceder a tu sitio y tus credenciales API.Conocimientos básicos en programaciónEs recomendable tener conocimientos  sobre desarrollo web y programación ya que la documentación se enfoca en la integración de la pasarela de pagos en tu sitio web o aplicación. \n url: https://placetopay-docs.placetopay.ws/"
    },
    {
      "content": "title: Cómo funciona Checkout \n Content: Checkout te permite recibir pagos en línea haciendo una integración muy sencilla desde tu sitio o aplicación. \n url: https://placetopay-docs.placetopay.ws/how-checkout-works"
    },
    {
      "content": "title: Ciclo de vida \n Content: \nCuando tus usuarios estén listos para completar el proceso de pago, tu aplicación debe crear un CheckoutSession.\nRedireccionar al usuario a la URL provista, esta URL contiene nuestro Checkout con todas sus funcionalidades listas.\nEl usuario ingresa los datos requeridos para completar el pago.\nEl usuario es redireccionado de vuelta al sitio del comercio.\nDespués de la transacción, una notificación es enviada para que la aplicación conozca el estado del pago.\nPara utilizar PlacetoPay Checkout, es necesario realizar una integración de código mediante servicios HTTP, donde tu aplicación o tienda en línea redirigirá a los usuarios a Checkout para que completen el proceso de pago. A continuación, se detallan los pasos necesarios para comenzar la integración. \n url: https://placetopay-docs.placetopay.ws/how-checkout-works"
    },
    {
      "content": "title: Integración \n Content: En el siguiente diagrama se describe de forma visual y con más detalle el ciclo de vida de una sesión de pagos en Checkout.Iniciar CheckoutCrear una sesión de pago\nPara aceptar un pago a través de Checkout, es necesario crear una sesión de pago (Checkout Sesssion) utilizando el método API - Crear sesión (CreateRequest).\nAl llamar a este servicio, se obtendrá la URL de proceso (processURL) y el identificador de solicitud (requestId).\nPuedes ver más en el apartado Crear SesiónRegistro del Pago en Proceso\nEn tu sistema, crear un registro que relacione el pago en proceso con el requestID proporcionado.\nEl estado inicial de todos los pagos es pendiente (PENDING).Redirección del Usuario\nEl usuario debe ser redireccionado a la URL de proceso (processURL) proporcionada por PlacetoPay Checkout.Proceso de Pago o Suscripción\nEn la interfaz de Checkout, el usuario completará el proceso de pago o suscripción. Checkout se encargará de recopilar todos los datos necesarios.Redirección de vuelta al sitio del comercio\nUna vez que el proceso de pago esté completo, el usuario puede ser redirigido de vuelta a la URL de retorno (returnUrl) especificada en la solicitud inicial (CreateRequest).En este punto es probable que el proceso de pago haya finalizado. Para conocer el estado del pago debes esperar la notificación o consultar el estado de la sesión.Notificación asincrónicaCuando una sesión tenga un estado final, PlacetoPay enviará una notificación asincrónica a tu sitio informando la finalización del proceso de pago. Asegúrate de manejar adecuadamente esta notificación para mantener la integridad de los datos.Consulta de sesionesSe debe consultar las sesiones para poder completar el ciclo de vida.Consulta del estado de la sesión\nAl llegar al sitio del comercio, se debe consultar el estado de la sesión.\nEsto se puede lograr utilizando el método API - Consultar sesión (getRequestInformation).Actualización y Reglas de Negocio\nSegún el estado final del pago obtenido, debes ejecutar las reglas de negocio correspondientes y actualizar la información relacionada con el pago en tu sistema. \n url: https://placetopay-docs.placetopay.ws/how-checkout-works"
    },
    {
      "content": "title: Qué sigue? \n Content: Listo, ahora que entiendes el ciclo de vída puedes continuar con:\nCrear Sesión\nPlugins y librerias\n \n url: https://placetopay-docs.placetopay.ws/how-checkout-works"
    },
    {
      "content": "title: Plugins y Componentes \n Content: Puedes usar nuestros plugins y componentes para integrarte de forma más rápida con Checkout. \n url: https://placetopay-docs.placetopay.ws/plugins"
    },
    {
      "content": "title: Plugins \n Content: WooCommercePlugin para WordPress. Diseñado para tiendas y comercios en linea que usan WordPress.Ver másMagentoPlataforma de código abierto para comercio electrónico escrita en PHP.Ver másPrestaShopPlataforma especializada en la creación y gestión de tiendas online.Ver másJumpsellerPlataforma de comercio electrónico para crear tu tienda en línea.VtexPlataforma de comercio digital para grandes empresas.ShopifyEn desarrollo... \n url: https://placetopay-docs.placetopay.ws/plugins"
    },
    {
      "content": "title: Librerias \n Content: PHPLenguaje de programación de código abierto, especialmente adecuado para el desarrollo webVer másC#Lenguaje de programación moderno y orientado a objetos desarrollado por MicrosoftVer másJavaLenguaje de programación de alto nivel y orientado a objetosVer más \n url: https://placetopay-docs.placetopay.ws/plugins"
    },
    {
      "content": "title: Lightbox \n Content: Lightbox es una forma de integrar Checkout que permite a tus usuarios completar el pago sin salir de tu página web.Cuando usas Lightbox, Checkout aparece de forma dinámica en el centro de la pantalla, ofreciendo una experiencia de pago reducida e integrada en tu página web.Esta solución permite mantener a los usuarios en tu sitio web o aplicación brindándoles comodidad y facilitando el proceso de pago. \n url: https://placetopay-docs.placetopay.ws/lightbox"
    },
    {
      "content": "title: Integración \n Content: Sigue estos pasos para completar tu integración forma exitosa.Agregar scriptPara integrar Lightbox debes agregar nuestro script en tu página web.<head>\n\t...\n    <script src=\"https://checkout.placetopay.com/lightbox.min.js\"></script>\n</head>\nLa url referenciada en el script puede cambiar de acuerdo al país y proveedor comercial con el que te estes integrando.InstanciaScript URLPlacetoPay Internacionalhttps://checkout.placetopay.com/lightbox.min.jsPlacetoPay Ecuadorhttps://checkout.placetopay.ec/lightbox.min.jsGetnet Chilehttps://checkout.getnet.cl/lightbox.min.jsGetnet Uruguayhttps://checkout.getnet.uy/lightbox.min.jsDavivienda Costa Ricahttps://checkout.davivienda.cr/lightbox.min.jsPago Link Atlántidahttps://pagoenlinea.bancatlan.hn/lightbox.min.jsAtlantic Bankhttps://abgateway.atlabank.com/lightbox.min.jsGoupagoshttps://checkout.goupagos.com.co/lightbox.min.jsIniciar LightboxEn tu servidor (backend) debes Crear una sesión y obtener la url de procesamiento processUrl.Comparte la url de procesamiento processUrl con el código javascript de tu cliente (frontend). Una vez esté disponibile puedes iniciar el Lightbox.var processUrl = \"https://checkout.placetopay.com/spa/session/76300/90443d4926a2...\";\n\nP.init(processUrl);\nTen en cuenta que si el lightbox no encuentra un ambiente propicio para su funcionamiento, se ejecutará una redirección a la URL de procesamiento.Registrar CallbackCuando el proceso en Checkout finalice, se emitira un \"callback\" a tu página web, asegurate de capturarlo para completar el flujo de forma exitosa.P.on('response', function (response) {\n\tconsole.log(data);\n});\nEl callback dispondrá del argumento response en el cual encontrarás la estructura de un sessionNotification con la siguiente información:SessionNotification{\n\t\"reference\": \"ABC_123\",\n\t\"requestId\": 12345,\n\t\"signature\": \"bodySignature\",\n\t\"status\": { \n\t\t\"date\": \"2023-07-11T11:34:37-05:00\",\n\t\t\"message\": \"The request has been successfully approved\",\n\t\t\"reason\": \"00\",\n\t\t\"status\": \"APPROVED\"\n\t} \n}\n \n url: https://placetopay-docs.placetopay.ws/lightbox"
    },
    {
      "content": "title: Integración Avanzada \n Content: Conoce en detalle los métodos y eventos disponiblesP.initInicializa el Lightbox.P.init(processUrl, options);\nPropiedadTipoDescripciónprocessUrlstringrequired  Url de procesamientooptionsobjectOpciones avanzadasoptions.opacitynumberTransparencia del fondo del lightbox.  Por Defecto: 0.7  Número entre 0 y 1  1 indica que el fondo no es transparente y 0 indica que es completamente transparente.P.onSuscribirse a eventos del lightbox.P.on(eventType, callback);\nPropiedadTipoDescripcióneventTypestringrequired  Nombre del evento a suscribirse  Posibles valores response closecallbackFunctionFunción callback a ejecutarse cuando ocurra el eventoListado de eventosEventoDescripciónParámetrosresponseSe ejecuta cuando se recibe una respuesta de PlacetoPay.SessionNotificationcloseSe ejecuta cuando el usuario cierra el Lightbox o cuando se cierra automáticamente al finalizar el proceso y este haber sido creado con un skipResult: trueN/AP.on('response', function (response) {\n\tconsole.log(response);\n});\n\n\nP.on('close', function () {\n\tconsole.log('El usuario cerró el Lightbox');\n});\nTambién es posible suscribirse a mas de un evento del mismo tipo, solo debes registrar cada uno de forma separada en P.on(). \n url: https://placetopay-docs.placetopay.ws/lightbox"
    },
    {
      "content": "title: Ejemplo de integración \n Content: A continuación el ejemplo más simple de cómo puedes integrar Lightbox en tu HTML.<!DOCTYPE html>\n<html lang=\"es\">\n<head>\n\t<meta charset=\"UTF-8\">\n\t<title>Lightbox SDK</title>\n\t<script src=\"https://checkout.placetopay.com/lightbox.min.js\"></script>\n</head>\n<body>\n\t<h1>Lightbox SDK</h1>\n\t\n\t<button id=\"open\">Abrir Lightbox</button>\n\t\n\t<script>\n\t\t<!-- Suscribe el evento close -->\n\t\tP.on('close', function () {\n\t\t\talert('El usuario cerró el Lightbox');\n\t\t});\n\n\t\t<!-- Suscribe el evento response -->\n\t\tP.on('response', function (response) {\n\t\t\tconsole.log(response);\n\t\t});\n\n\t\t<!-- Abre el Lightbox al hacer click en el botón -->\n\t\tdocument.getElementById('open').addEventListener('click', function () {\n\t\t\tvar processUrl = \"https://checkout.placetopay.com/spa/session/123456/1234567890abc1234567890abc12345\";\n\n\t\t\tP.init(processUrl);\n\t\t});\n\t</script>\n</body>\n</html>\n \n url: https://placetopay-docs.placetopay.ws/lightbox"
    },
    {
      "content": "title: Autenticación \n Content: Para interactuar con la API de Checkout debes autenticar tus peticiones, de esta forma identificamos y validamos la información para que tus operaciones sean seguras. La API utiliza Web Services Security UsernameToken Profile 1.1. \n url: https://placetopay-docs.placetopay.ws/authentication"
    },
    {
      "content": "title: Credenciales API \n Content: Para integrarse con Checkout debes contar con tus credenciales login y secretKey.\nlogin: Identificador del sitio, puede considerarse público pues viaja como dato plano en las peticiones API.\nsecretKey: Llave secreta del sitio, debe ser privada, a partir de este dato se generará un nuevo tranKey que será enviado en las peticiones.\nEstas credenciales son própias de tu sitio y deben ser tratadas de forma segura. No compartas tus credenciales en áreas de acceso público como Github, código del lado de cliente u otros lugares de facil acceso para terceros. \n url: https://placetopay-docs.placetopay.ws/authentication"
    },
    {
      "content": "title: Objeto Authentication \n Content: El parámetro auth debe ser enviado en todas la peticiones API y contiene el grupo de propiedades necesarias para verificar la autenticación.Nameauth.loginTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Identificador del sitioNameauth.tranKeyTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Credencial tranKey generado. A continuación se explica en detalle.Nameauth.nonceTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Valor aleatorio para cada solicitud codificado en Base64.Nameauth.seedTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Fecha actual, la cual se genera en formato ISO 8601.Autenticación de Ejemplo{    \n  \"auth\": {\n    \"login\":\"1441d14df19ec88431e513bb990326e1\",\n    \"tranKey\":\"DGYymv6ohpYwtLWon/iADE/COoo9JXt4jqyk6D006PY=\",\n    \"nonce\":\"enQ4dXh3YWhkMWM=\",\n    \"seed\":\"2023-06-21T09:56:06-05:00\"\n  },\n  ...\n}\n\n \n url: https://placetopay-docs.placetopay.ws/authentication"
    },
    {
      "content": "title: Cómo generar tu autenticación \n Content: Debes conocer y preparar los siguientes datos:login: Credencial login provista al inicar tu integración. Identificador del sitio.secretKey: Credencial secretKey provista al iniciar tu integración. Llave secreta del sitio.seed: Se trata de la fecha en la que se generó la autenticación. La fecha debe estar en formato ISO 8601.\nEjemplo: 2023-06-21T09:56:06-05:00nonce: Valor arbirario que identifica a una petición cómo única.\nSe genera y se utiliza para otras operaciones.\nAl momento de enviarlo, debe ser codificado en base 64.\nEjemplo: base64('927342197')tranKey: Se genera en cada solicitud de forma programatica.\nSe genera con la siguiente formula Base64(SHA-256(nonce + seed + secretKey)) esta formula debe ser traducida según el lenguaje de programación utilizado.Generate authentication$login = \"siteLogin\";\n$secretKey = \"siteSecretKey\";\n$seed = date('c');\n$rawNonce = rand();\n\n$tranKey = base64_encode(hash('sha256', $rawNonce.$seed.$secretKey, true));\n$nonce = base64_encode($rawNonce);\n\n$body = [\n  \"auth\" => [\n    \"login\" => $login,\n    \"tranKey\" => $tranKey,\n    \"nonce\" => $nonce,\n    \"seed\" => $seed,\n  ],\n  // ... other params\n];\n \n url: https://placetopay-docs.placetopay.ws/authentication"
    },
    {
      "content": "title: Posibles errores \n Content: CódigoCausa100UsernameToken no proporcionado (Encabezado de la autorización mal formado).101Identificador de sitio no existe ( Login incorrecto o no se encuentra en el ambiente).102El hash de TranKey no coincide (Trankey incorrecto o mal formado).103Fecha de la semilla mayor de 5 minutos.104Sitio inactivo.105Sitio expirado.106Credenciales expiradas.107Mala definición del UsernameToken (No cumple con el encabezado WSSE).200Saltar el encabezado de autenticación SOAP.10001Contacte a Soporte. \n url: https://placetopay-docs.placetopay.ws/authentication"
    },
    {
      "content": "title: Errores frecuentes \n Content: Mensaje de error “Autenticación mal formada”:\nSe presenta cuando el sistema no detecta que se esté enviando login, tranKey, seed o nonce en la estructura auth enviada, también puede presentarse si se envían estos datos pero de manera incorrecta, es decir sin el parámetro content-type “application/json” de manera que el servidor interpreta la petición como texto en lugar de un arreglo de datos. Puedes validar esto haciendo la petición a la URL https://dnetix.co/p2p/client y capturando la respuesta, es una especie de espejo de la petición que te permitirá comprobar los parámetros y el body del mensaje.Error conectando al servicio con el mensaje ERROR: javax.net.ssl.SSLHandshakeException: Remote host closed connection during handshake:\nTus servidores requieren TLSv1.2 para recibir la solicitud, debido a la norma PCI. Por favor, revisa el cifrado y el protocolo utilizado para conectar al servidor. Si usas Java, ten presente que solo las versiones después de la 8 tienen soporte completo.SoapFault responde con el mensaje \"Authentication Failed 103\":\nEn el proceso de autenticación, Placetopay revisamos el campo Created, este campo debe estar en el tiempo GMT o el tiempo local usando el tiempo de zona. Si obtienes esta respuesta, se debe a que tu tiempo no es preciso con el tiempo real. Nosotros solo permitimos 5 minutos de diferencia entre los tiempos. Puedes usar NTP para mantener la precisión del reloj.Dando los mismos valores EXACTOS que en los ejemplos anteriores a la BASE64(SHA256($Nonce + $Created . $secretKey)) estoy obteniendo un password digest diferente.:\nMantén en mente que BASE64 debería ser para el raw output de la SHA256 y de acuerdo con todos los lenguajes de programación este puede ser requerido para configurar esta opción, por ejemplo. En PHP base64_encode(hash('sha256' … , true)) este parámetro retornaría el raw output para el SHA256 algorithm \n url: https://placetopay-docs.placetopay.ws/authentication"
    },
    {
      "content": "title: Crear Sesión \n Content: Sesión es el término que usamos para referirnos al proceso de pago con el que interactuan tus usuarios en Checkout.Para crear una sesión debes consumir nuestro API según tus necesidades, conoce los detalles del API en API - Crear Sesion. \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Pago Básico \n Content: Una sesión de pago básico es una sesión en la cual esperas recibir un pago único de un usuario.CreateSessionRequest - Simple{\n    ...\n    \"payment\": {\n        \"reference\": \"PAY_ABC_1287\",\n        \"description\": \"Pago por Placetopay\",\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 1000\n        },\n    }\n    ...\n}\n \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Pagos Parciales \n Content: Una sesión de pago parcial es una sesión en la cual un usuario puede hacer varias transacciones de distintos montos o con diferentes medios de pago hasta completar el total solicitado en la misma sesión.Para usar esta funcionalidad se debe enviar la propiedad payment.allowPartial como true.CreateSessionRequest - Partial Payment{\n    ...\n    \"payment\": {\n        \"reference\": \"PAY_ABC_1287\",\n        \"description\": \"Pago por Placetopay\",\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 1000\n        },\n        \"allowPartial\": true\n    }\n    ...\n}\nCuando se hace una sesión de pagos parciales, aparecen nuevo escenarios que se deben controlar:\nLa sesión finaliza con el estado APPROVED_PARTIAL, ocurre cuando en la sesión se hizo al menos una transacción APPROVED, pero no se completó el total del monto solicitado.\nLa sesión finaliza con el estado PARTIAL_EXPIRED, ocurre cuando en la sesión se hizo al menos una transacción APPROVED, pero no se completó el toal del monto solicitado y la sesión expiró.\nLas sesiones parciales tambien tienen condicinoes adicionales como:\nNo se aceptan impuestos, pues no se pueden dividir los impuestos en diferentes transacciones.\n \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Pago Recurrrente \n Content: Una sesión de pago recurrente es una sesión en la cual el usuario completa el proceso con una tarjeta de crédito, y a partir de ese momento periodicamente se le realizan cobros automáticos al medio de pago. Por ejemplo, en el pago de una mensualidad o suscripción a un servicio.Para usar esta funcionalidad se debe enviar la propiedad payment.recurring con la estructura Recurrence.CreateSessionRequest - Recurring Payment{\n    ...\n    \"payment\": {\n        \"reference\": \"PAY_ABC_1287\",\n        \"description\": \"Pago por Placetopay\",\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 1000\n        },\n        \"recurring\": {\n            \"periodicity\": \"D\",\n            \"interval\": \"1\",\n            \"nextPayment\": \"2024-08-24\",\n            \"maxPeriods\": 1,\n            \"dueDate \": \"2024-09-24\",\n            \"notificationUrl \": \"https://merchanturl.com/notify\"\n        },\n    }\n    ...\n}\n\nEl atributo nextPayment no es obligatorio, en caso de que no se envié, se calcula dependiendo del atributo interval y periodicity, en caso de que se declare debe ser una fecha futura a la fecha actual.\nEn el caso de fallar un cobro recurrente, éste seguirá reintentado una vez cada día durante 3 días, si luego de esto no se obtiene una transacción aprobada, la recurrencia se le cancela al tarjetahabiente.\nLa recurrencia se deja de reintentar si la primera respuesta no tiene sentido reintentar (Tarjeta invalida, robada, etc), es decir se reintenta sólo si es por saldo.\nLas recurrencias sólo pueden ser canceladas en la consola administrativa de PlacetoPay.\nEntidad RecurringSe usa para describir la frecuencia y las condiciones con las cuales se harán cobros recurrentes.NameperiodicityTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Periodicidad de la factura D Día | M Mes | Y AñoNameintervalTypeintis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Intervalo asociado a la periodicidad.NamemaxPeriodsTypeintis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Número máximo de periodo (-1 en caso de que no haya restricción.)NamenextPaymentTypestringis optionalOPTIONALDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Fecha del próximo pago.NamedueDateTypestringis optionalOPTIONALDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Fecha para finalizar el pago.NamenotificationUrlTypestringis optionalOPTIONALDescription:first-child]:mt-0 [&>:last-child]:mb-0\">URL en el que el servicio notificará cada vez que se haga un pago recurrente.Recurring{    \n  \"periodicity\": \"D\",\n  \"interval\": \"1\",\n  \"maxPeriods\": 1,\n  \"nextPayment\": \"2024-08-24\",\n  \"dueDate \": \"2024-09-24\",\n  \"notificationUrl \": \"https://merchanturl.com/notify\"\n}\n\n \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Pago con Dispersión \n Content: Una sesión de dispersión es una sesión en la cual el monto total del pago será dividido en diferentes destinos.Para usar este tipo de sesión, debes enviar la propiedad payment.dispersión que contiene un arreglo de DispersionRequestsCreateSessionRequest - Dispersion Payment{\n    ...\n    \"payment\": {\n        \"reference\": \"PAY_ABC_1287\",\n        \"description\": \"Pago por Placetopay\",\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 1000\n        },\n        \"dispersion\": [\n            {\n                \"amount\": {\n                    \"total\": 700,\n                    \"currency\": \"USD\"\n                },\n                \"agreement\": 30,\n                \"agreementType\": \"AIRLINE\"\n            },\n            {\n                \"amount\": {\n                    \"total\": 300,\n                    \"currency\": \"USD\"\n                },\n                \"agreementType\": \"MERCHANT\"\n            }\n        ],\n    }\n    ...\n}\nEl pago puede ser dividoe en diferentes convenios registrados, además permite que cada parte de la transacción sea procesada por diferentes proveedores.Para hacer uso de esta funcionalidad es importante conocer el identificador del convenio (agreement) a donde va dirigido el pago. Si no se agrega ningún valor de aggreement, se tomará por defecto el medio de pago configurado en el sitio de la sesión, también es necesario indicar el tipo de convenio (aggrementType), en este caso MERCHANT o AIRLINE.\nNo se permiten pagos parciales cuando se crea una sesión de dispersión.\nNo se permiten pagos de preautorización cuando se crea una sesión de dispersión.\nLa suma total de las dispersiones deben ser igual al total del pago.\nTodas las monedas de las dispersiones deben ser igual a la moneda del pago\nPara el envió de impuestos, es importante que se encuentre en la estructura de cada una de las dispersionesCreateSessionRequest - Dispersion Payment Taxes{\n    ...\n    \"payment\": {\n        ...\n        \"dispersion\": [\n            {\n                \"amount\": {\n                    \"total\": 700,\n                    \"currency\": \"USD\"\n                },\n                \"agreement\": 30,\n                \"agreementType\": \"AIRLINE\",\n                \"taxes\": [\n                    {\n                        \"kind\": \"airportTax\",\n                        \"amount\": 16.13\n                    }\n                ],\n                \"details\": [\n                    {\n                        \"kind\": \"tip\",\n                        \"amount\": 11\n                    }\n                ]\n            },\n            \n        ],\n    }\n    ...\n}\n \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Preautorización de Pago \n Content: Una sesión de preautorización es una sesión en la cual el usuario completa el proceso y el monto solicitado es reservado en su tarjeta de crédito, luego de la reserva el monto puede ser modificado, confirmado o cancelado.Este flujo de trabajo es usado con el fin de reservar (CHECKIN) un monto de dinero en el tarjetahabiente para posteriormente hacer el débito del mismo, en este caso (CHECKOUT). Este monto en el transcurso del tiempo puede cambiar (REAUTHORIZATION) según las necesidades del comercio o cambios en los servicios elegidos por el tarjetahabiente. Por último, el reverso (REVERSE) es un tipo de transacción, el cual permite reversar un pago aprobado o debitado con el código de referencia interna.CreateSessionRequest - Preauthorization Payment{\n    ...\n    \"type\": \"checkin\",\n    \"payment\": {\n        \"reference\": \"PAY_ABC_1287\",\n        \"description\": \"Pago por Placetopay\",\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 1000\n        }\n    }\n    ...\n}\nLa transacción tipo CHECKIN es utilizada para obtener una autorización por parte del banco. Realiza un débito a una tarjeta de crédito/débito el cual se utiliza como depósito de garantía por la utilización de un bien o servicio.\nNo se permiten pagos de preautorización cuando se quiere hacer un pago mixto.\nNo se permiten pagos de preautorización con valores de dispersión.\nReautorizationSe aplica sobre transacciones de preautorización y se usa para modificar el monto anteriormente reservado.La transacción tipo REAUTHORIZATION es utilizada para modificar el monto definido como depósito de garantía separado previamente, con una transacción tipo CHECKIN. Esto realiza una nueva autorización por parte del banco.TransactionActionRequest - Reauthorization{\n    ...\n    \"internalReference\": 1, //código de referencia interna\n    \"amount\": {\n        \"currency\": \"USD\",\n        \"total\": 100\n    },\n    \"action\": \"reauthorization\"\n    ...\n}\nCheckoutSe aplica sobre transacciones de preautorización y se usa para confirmar y cerrar la transacción con el monto indicado.La transacción tipo CHECKOUT es utilizada para confirmar el monto del depósito de garantía separado previamente, con una transacción tipo CHECKIN/REAUTHORIZATION. Esto formaliza la transacción de compra con el banco.TransactionActionRequest - Reauthorization{\n    ...\n    \"internalReference\": 1, //código de referencia interna\n    \"amount\": {\n        \"currency\": \"USD\",\n        \"total\": 100\n    },\n    \"action\": \"checkout\"\n    ...\n}\n \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Suscripción \n Content: Una sesión de suscripción es una sesión en la cual el usuario ingresa un medio de pago para tokenizarlo y que luego podrá ser usado para cobrar sobre ese medio de pago.La suscripción permite almacenar de forma segura (tokenizando) el medio de pago de un usuario, para que luego pueda efectuar cobros relacionados a éste.Para hacer uso de esta funcionalidad es necesario enviar en el RedirectRequest la estructura subscription.CreateSessionRequest - Subscription{\n    ...\n    \"subscription\": {\n        \"reference\": \"3110\",\n        \"description\": \"Una suscripción de prueba\"\n    },\n    ...\n}\nCobrar sobre un medio de pago tokenizadoCuando se realiza una suscripción se obitne un token, con este token puedes hacer cobros al cliente.La estructura de la respuesta contiene toda la información de la petición original y una estructura de suscripción (subscription) con un instrumento (instrument) representado en forma de token.CollectRequest{\n    ...\n    \"payment\": {\n        \"reference\": \"1122334455\",\n        \"description\": \"Prueba\",\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 100\n        }\n    },\n    \"instrument\": {\n        \"token\": {\n            \"token\": \"e07ca9986cf0ecac8a557fa11c07bf37ea35e9e3e3a4180c49\"\n        }\n    },\n    ...\n}\nLa información del token debe ser almacenada en su sitio y relacionada al usuario y/o producto. Luego de tener el token, puede generar cobros al medio de pago tokenizado usando el servicio collect.* \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Pago con suscripción \n Content: Un pago se puede convertir en pago y subscripción al mismo tiempo, para realizar este flujo es importante agregar en el objeto payment el atributo subscribe en true de la siguiente maneraPara usar este tipo de sesión, debes enviar la propiedad payment.subscribe como trueCreateSessionRequest - Payment with Subscription{\n    ...\n    \"payment\": {\n        \"reference\": \"PAY_ABC_1287\",\n        \"description\": \"Pago por Placetopay\",\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 1000\n        },\n        \"subscribe\": true\n    }\n    ...\n}\nEn el proceso de pago el usuario podrá elegir si quiere suscribir el medio de pago. \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Conceptos Adicionales \n Content: Manejo decimales y monedasAl momento de realizar la creación de una sesión de pago, webcheckout utiliza la ISO 4217 para realizar validaciones y almacenamiento de los montos a pagar.Según el tipo de sesión se podrá presentar alguno de los siguientes casos:Sesión de pago estandar\nEl valor del campo payment.total.amount será redondeado en base a la ISO 4217 y posteriormente almacenado.\nSesión de pago con dispersión\nSe redondea cada uno de los valores de la dispersión en base a ISO 4217.\nSe realiza una sumatoria de los valores anteriormente redondeados.\nSe comparará la sumatoria de la dispersión con el payment.amount.total redondeado,  si la suma es correcta, la sesión se creará con éxito.\nEjemplos:USD: \n576.12345 => 576.12\n576.9875 => 576.99\n\nCLP:\n576.12345 => 576\n576.9875 => 577\n\nCOP:\n576.12345 => 576.12\n576.9875 => 576.99\n \n url: https://placetopay-docs.placetopay.ws/create-session"
    },
    {
      "content": "title: Localización \n Content: La API e interfaz de checkout soporta varios idiomas, tu puedes elegir en qué idioma quieres interactuar.Para elegir el idioma debes enviar el parámetro locale en las peticiones que hagas, este tambien es el idioma inicial que tendrá la sesión.{\n    \"locale\": \"es_CO\",\n    ...\n}\nEl parámetro locale es un string que contiene el código de localización. Por ejemplo es_CO.  Es un parámetro opcional, en caso de que no se envíe o no cumpla con los estándares previamente descritos, se tomará por defecto el locale y país del sitio que está creando la sesión.Ejemplos:LocaleIdiomaPaíses_COEspañol (es)Colombia (CO)es_ECEspañol (es)Ecuador  (EC)es_ECEspañol (es)Ecuador  (EC)en_USInglés  (en)Estados Unidos (US)Este parámetro se compone por el código del lenguaje según el estándar ISO 631-1, seguido de un guión bajo _ y 2 letras que corresponden al país según el estándar ISO 3166-1 alpha-2. \n url: https://placetopay-docs.placetopay.ws/localization"
    },
    {
      "content": "title: Seguridad \n Content: En este apartado se presentan los diferentes módulos de seguridad que Placetopay tiene disponible según los diferentes países en los que se encuentra. Para hacer uso de estos módulos de seguridad NO es necesario realizar ninguna integración adicional. \n url: https://placetopay-docs.placetopay.ws/security"
    },
    {
      "content": "title: 3DS \n Content: El protocolo de autenticación 3-D Secure se basa en un modelo de tres dominios en el que el Dominio del adquirente y el Dominio del emisor están conectados por el Dominio de interoperabilidad con el fin de autenticar a un Titular de tarjeta durante una transacción de comercio electrónico (e-commerce) o para proporcionar verificación de identidad y confirmación de cuenta.Disponible en:\n- Ecuador (EC)\n- Costa Rica (CR)\n- Colombia (CO)\n- Panamá (PA)\n \n url: https://placetopay-docs.placetopay.ws/security"
    },
    {
      "content": "title: Scudo \n Content: Scudo te ayuda a reducir al máximo el riesgo de contracargos a través de un sistema modular de control de fraude, manteniendo un adecuado balance entre la tasa de aprobación y los costos de operación.\nContamos con módulos personalizables de acuerdo a la realidad de la compañía, solo activas los que necesitesDisponible en:\n- Ecuador (EC)\n- Costa Rica (CR)\n- Colombia (CO)\n- Panamá (PA)\n- Puerto Rico (PR)\n- Chile (CL)\n \n url: https://placetopay-docs.placetopay.ws/security"
    },
    {
      "content": "title: AVS \n Content: El servicio de verificación de direcciones (AVS) es un servicio de prevención de fraude para transacciones con tarjetas no presente usando la dirección del titular.Disponible en:\n- Puerto Rico (PR)\n \n url: https://placetopay-docs.placetopay.ws/security"
    },
    {
      "content": "title: Tipos de documento \n Content: Al momento de solicitar crear una sesión, si usa alguna de las estructuras payer, buyer o shipping deberá enviar en el atributo DocumentType alguno de los siguientes códigos  dependiendo del país:AVISO IMPORTANTE:\n\nSegún  del tipo de documento enviado el sistema realizará la validación basado en  expresiones regulares\nGlobalCódigoTipo de documentoRegla de validaciónPPNPasaporte'/^[a-zA-Z0-9_]{4,16}$/'TAXTAX'/^[a-zA-Z0-9_]{4,16}$/'LICLabeler Identification Code'/^[a-zA-Z0-9_]{4,16}$/'Puerto Rico (PR)Para integraciones en este país no se realiza el envío de DocumentType ni del Document.Sin embargo, los documentos habilitados para este país sonCódigoTipo de documentoRegla de validaciónEINEmployer Identification Number'/^[1-9]\\d?-\\d{7}$/'Colombia (CO)CódigoTipo de documentoRegla de validaciónCCCédula de ciudadanía'/^[1-9][0-9]{3,9}$/'CECédula de extranjería'/^([a-zA-Z]{1,5})?[1-9][0-9]{3,7}$/'TITarjeta de identidad'/^[1-9][0-9]{4,11}$/'NITNúmero de Identificación Tributaria '/^[1-9]\\d{6,9}$/'RUTRegistro único tributario'/^[1-9]\\d{6,9}$/'Ecuador (EC)CódigoTipo de documentoRegla de validaciónCICédula de identidad'/^\\d{10}$/'RUCRegistro Único de Contribuyentes'/^\\d{13}$/'Costa Rica (CR)CódigoTipo de documentoRegla de validaciónCRCPFCédula personal física'/^[1-9][0-9]{8}$/'CPJCédula personal juridica'/^[1-9][0-9]{9}$/'DIMEXDIMEX- Docuemnto de identificación de Migración y Extranjería'/^[1-9][0-9]{10,11}$/'DIDIDIDI - Docuemnto de identificación de diplomáticos'/^[1-9][0-9]{10,11}$/'Chile (CL)CódigoTipo de documentoRegla de validaciónCLRUTCédula personal física'/^(\\d{1,2}(?:\\.?\\d{1,3}){2}-[\\dkK])$/'Panamá (PA)CódigoTipo de documentoRegla de validaciónCIPCédula de identidad personal/^(N,E,PE\\d+)?\\d{2,6}\\d{2,6}$/PARUCRegistro Único de Contribuyente^[a-zA-Z0-9\\-]{1,16}$/Brasil (BR)CódigoTipo de documentoRegla de validaciónCPFCadastro de Pessoas Físicas'/^\\d{10,11}$/'Perú (PE)CódigoTipo de documentoRegla de validaciónDNIDNI'/^\\d{8}$/'PERUCRegistro Único de Contribuyentes'/^(10,15,16,17,20)[0-9]{9}$/'Honduras (HN)CódigoTipo de documentoRegla de validaciónHNDNIDocumento nacional de identificación'/^[a-zA-Z0-9]{1,15}$/'HNDRDocumento de residencia'/^[a-zA-Z0-9]{1,15}$/'RTNNúmero de registro tributario'/^[0-9]{14,16}$/'Belice (BZ)CódigoTipo de documentoRegla de validaciónBZSSNIdentificación de Seguridad Social'/^[0-9]{9}$/'BRNBusiness Registration number'/^[0-9]{5,7}$/'Uruguay (UY)CódigoTipo de documentoRegla de validaciónUYCICédula de Identidad'/^\\d{6,7}-[0-9]$/'UYRUTRegistro Único Tributario'/^\\d{12}$/' \n url: https://placetopay-docs.placetopay.ws/document-types"
    },
    {
      "content": "title: Taxes (Impuestos) \n Content: Los impuestos son los tributos que las personas están obligadas a pagar a alguna organización.Dependiendo de la actividad sobre la que recaiga, se le aplica un impuesto u otro. Presentan variación en la cuantía que el interesado debe abonar. Esto se basa en la normativa que presente cada sistema tributario. \n url: https://placetopay-docs.placetopay.ws/tax-details"
    },
    {
      "content": "title: Tipos de Impuestos \n Content: El valor kind representa el tipo de impuesto que está incluido en el pago, los diferentes tipos de impuestos son:KindTraducciónPaísvalueAddedTaxIVATodosexciseDutyImpuestoTodosiceICETodosairportTaxTasa aeroportuariaColombia y EcuadorstateTaxIVU EstatalPuerto RicomunicipalTaxIVU MunicipalPuerto RicoreducedStateTaxIVU ReducidoPuerto Rico\nImportante\nCuando se escribe erroneamente el kind o no existe en el listado de tipos de impuestos, el tax no se incluye dentro de la sesión de Webcheckout\n \n url: https://placetopay-docs.placetopay.ws/tax-details"
    },
    {
      "content": "title: Estructura de los impuestos \n Content: los taxes estan dentro de la estructura amount siendo el atributo taxes un arreglo de objetosEjemplo{\n  \"payment\": {\n    \"amount\": {\n      \"currency\": \"COP\",\n      \"total\": 10000,\n      \"taxes\": [\n        {\n          \"kind\": \"valueAddedTax\",\n          \"amount\": 1000,\n          \"base\": 0\n        },\n        {\n          \"kind\": \"ice\",\n          \"amount\": 1500,\n          \"base\": 0\n        }\n      ]\n    }\n  }\n}\n \n url: https://placetopay-docs.placetopay.ws/tax-details"
    },
    {
      "content": "title: Details (Detalles) \n Content: Los Details son los detalles que pueden tener una transacción \n url: https://placetopay-docs.placetopay.ws/tax-details"
    },
    {
      "content": "title: Tipos de detalles \n Content: El valor kind representa el tipo de detalle que está incluido en el pago, los diferentes tipos de detalles son:KindTraduccióndiscountDescuentoadditionalAdicionalvatDevolutionBaseBase devoluciónshippingEnvíohandlingFeeCuota manejoinsuranceSegurogiftWrapRegalosubtotalSubtotalfeeCobrotipPropinaairlineAerolíneainterestsIntereses\nNota Importante\nCuando se escribe erroneamente el kind o no existe en el listado de tipos de detalles, el detail no se incluye dentro de la sesión de Webcheckout\n \n url: https://placetopay-docs.placetopay.ws/tax-details"
    },
    {
      "content": "title: Estructura de los detalles \n Content: los details estan dentro de la estructura amount siendo el atributo details un arreglo de objetosEjemplo{\n  \"payment\": {\n    \"amount\": {\n      \"currency\": \"COP\",\n      \"total\": 10000,\n      \"details\": [\n        {\n          \"kind\": \"tip\",\n          \"amount\": 1000\n        },\n        {\n          \"kind\": \"interests\",\n          \"amount\": 1500\n        }\n      ]\n    }\n  }\n}\n\nImportante\nNo se permite el uso de pagos mixtos cuando se utilizan taxes/details ya que estos no se pueden dividir y genera un error al crear la sesión\n \n url: https://placetopay-docs.placetopay.ws/tax-details"
    },
    {
      "content": "title: Métodos de pago \n Content: Cuando usas Checkout, tienes disponibles todos los métodos de pago integrados en Placetopay.En PlacetoPay Checkout, ofrecemos una amplia variedad de opciones de pago para tus clientes. Desde tarjetas de crédito y débito hasta billeteras electrónicas y transferencias bancarias, contamos con diversos métodos de pago integrados en nuestra plataforma. Ten en cuenta que la disponibilidad puede variar según el país. Para más información, contáctanos durante el proceso de integración.Ofrecer múltiples opciones de pago es fundamental para brindar flexibilidad a tus clientes y aumentar las probabilidades de conversión. Con PlacetoPay Checkout, tendrás acceso a métodos de pago confiables y seguros, lo que te permitirá ofrecer una experiencia de compra completa y satisfactoria para tus clientes. \n url: https://placetopay-docs.placetopay.ws/payment-methods"
    },
    {
      "content": "title: Global \n Content: NombreIDTarjeta VisavisaTarjeta MastercardmasterTarjeta Diners ClubdinersTarjeta American ExpressamexPaypalpaypalSafety Paysafetypay \n url: https://placetopay-docs.placetopay.ws/payment-methods"
    },
    {
      "content": "title: Colombia \n Content: NombreIDDébito a cuentas corrientes y ahorros (PSE)pseTarjeta débito Visa Electronvisa_electronTarjeta Somos Grupo EPMsomosTarjeta CODENSAcodensaBotón BancolombiabancolombiaComfandicomfandiCAFAMcafamTarjeta MefiamefiaTarjeta ÉxitoexitoTarjeta AlkostoalkostoOKI - GanaganaBilletera CompensarprocesaEfectivoath \n url: https://placetopay-docs.placetopay.ws/payment-methods"
    },
    {
      "content": "title: Chile y Uruguay \n Content: NombreIDTarjeta Maestromaestro \n url: https://placetopay-docs.placetopay.ws/payment-methods"
    },
    {
      "content": "title: Panamá / Costa Rica / Belice / Honduras \n Content: NombreIDTarjeta Discover  discoverTarjeta Clavetelered \n url: https://placetopay-docs.placetopay.ws/payment-methods"
    },
    {
      "content": "title: Puerto Rico \n Content: NombreIDATH Móvil athmvTarjeta ATH - EBUSath_cardACH - EBUSebach \n url: https://placetopay-docs.placetopay.ws/payment-methods"
    },
    {
      "content": "title: Perú \n Content: NombreIDPago Efectivopagoefectivo \n url: https://placetopay-docs.placetopay.ws/payment-methods"
    },
    {
      "content": "title: Prueba tu integracion \n Content:  \n url: https://placetopay-docs.placetopay.ws/test-your-integration"
    },
    {
      "content": "title: URL's Base \n Content: Placetopay habilita diferentes URL base según el país con el que te estas integrandoPruebas\nColombia, Costa Rica, Panamá, Puerto Rico:\nEcuador:\nProducción\nColombia, Costa Rica, Panamá, Puerto Rico:\nEcuador:\n \n url: https://placetopay-docs.placetopay.ws/test-your-integration"
    },
    {
      "content": "title: Tarjetas de prueba \n Content: Estas tarjetas pueden ser usadas en el ambiente de pruebas de Placetopay para simular las diferentes respuestas en la integraciónPara ver más ir a Gateway API - Tarjetas de prueba \n url: https://placetopay-docs.placetopay.ws/test-your-integration"
    },
    {
      "content": "title: Notificacion \n Content: Una notificación permite informar al comercio sobre el estado de las sesiones.Configura en tu servidor una URL de notificación usando los puertos 80 o 443 y en caso de que la sesión se cancele o apruebe, reciba una notificación mediante POST.{\n  \"type\": \"object\",\n  \"properties\": {\n    \"requestID\": {\n      \"type\": \"integer\"\n    },\n    \"reference\": {\n      \"type\": \"string\"\n    },\n    \"signature\": {\n      \"type\": \"string\"\n    }\n  }\n}\nDe manera asincrónica, una notificación del estado de la petición será enviada a una URL definida por configuración del comercio en PlacetoPay.Al recibir la notificación su sitio debe:Identificar operación:\nCon el identificador de la sesión requestId y la referencia reference identifican la sesión notificada. Para esta sesión debe validar que el estado de la operación notificada están pendientes en su sistema.Validar autenticidad de la notificación:\nPuedes validar que se trate de una respuesta de PlacetoPay haciendo un SHA-1 con los datos requestId + status + date + secretKey.Validar que la transacción se encuentre sin resolverSi deseas obtener más información sobre la sesión debes usar el método getRequestInformationBajo ninguna circunstancia reveles tu secretKey en ninguna parte accesible a los clientes o usuarios de su aplicación.\nLuego de obtener el estado de la sesión, puede continuar con la regla de negocio de su sitio. (ejemplo: si la operación es aprobada, envía un correo electrónico al usuario). \n url: https://placetopay-docs.placetopay.ws/notification"
    },
    {
      "content": "title: Historial de cambios - Changelog \n Content: Este archivo contiene las mejoras y actualizaciones que se hagan en Checkout API. \n url: https://placetopay-docs.placetopay.ws/changelog"
    },
    {
      "content": "title: Sin desplegar \n Content: Nuevo\nPermite invalidar un token InstrumentInvalidateRequest usando el subtoken.\n \n url: https://placetopay-docs.placetopay.ws/changelog"
    },
    {
      "content": "title: 2.17.0 2023-05-25 \n Content: Nuevo\nSe agrega el endpoint Instrument Invalidate /api/instrument/invalidate que sirve para invalidar tokens ya existentes del sitio.\n \n url: https://placetopay-docs.placetopay.ws/changelog"
    },
    {
      "content": "title: API Version Policy \n Content: En Placetopay contamos con una única versión del api disponible hasta la fecha. Tal que si te vas a conectar o ya estas conectado con nuestro api, estás usando la única versión disponible.Al tratarse de una única versión de API, todas las funcionalidades nuevas y ajustes se hacen en la misma versión del API y pretenden ser retro-compatibles. \n url: https://placetopay-docs.placetopay.ws/api-policy"
    },
    {
      "content": "title: Cambios Retro-compatibles \n Content: En Placetopay consideramos los siguientes cambios retro-compatibles:Agregar nuevos recursos y endpoints.Cuando se agrega una nueva funcionalidad, es muy probable que venga acompañada de un nuevo endpoint y/o recurso.Ejemplo: Si se hiciera el lanzamiento de un nuevo API para obtener usuarios, la funcionalidad llevaría a un nuevo recurso User y nuevo endpoint api.com/users.Agregar nuevos parámetros opcionales a las solicitudes de API existentesDebido a la evolución de algunas funcionalidades, es probable que agreguemos nuevos parámetros opcionales en las solicitudes que pueden hacer los clientes integradores.Ejemplo: En el api CreateRequest se podría agrega un parámetro opcional notificationUrl para aquellos clientes integradores que quieren definir la url de notificación de esa sesión.// CreateRequest body\n\n{\n  ...\n  \"payment\": { ... }\n  \"notificationUrl\": \"http://example.com\" // new optional parameter\n  ...\n}\nEste nuevo parámetro será opcional y no afectará las integraciones existentes.Agregar nuevas propiedades en respuestas de API existentesDebido a la evolución de algunas funcionalidades, es probable que algunas respuestas del api incluyan nuevas propiedades.Ejemplo: En el api GetRequestInformation la respuesta puede ser modificada para incluir una nueva propidad cancelled dentro de la propiedad subscription// GetRequestInformation Response\n{\n  ...\n  \"subscription\": {\n    ...\n    \"cancelled\": true, // new property\n    ...\n  }\n  ...\n}\nEsta nueva propiedad será incluida y no afectará las integraciones existentes.Cambiar el orden de propiedades en respuestas de API existentesDebido a la evolución de algunas funcionalidades, es probable que algunas respuestas del api cambien el orden de sus propiedades.Ejemplo: En el api GetRequestInformation la respuesta puede ser modificada para que el orden de las propiedades sea diferente.// current\n{\n  \"requestId\": \"123\",\n  \"status\": { ... },\n  ...\n}\n\n// changes to\n{\n  \"status\": { ... }, // changed order\n  \"requestId\": \"123\",\n  ...\n}\nEste cambio no afectará las integraciones existentes.Cambiar parámetros requeridos a opcionales en las solicitudes de API existentesDebido a la evolución de algunas funcionalidades, es probable que cambiemos un parámetro existente que es requerido a opcional en las solicitudes que pueden hacer los clientes integradores.Ejemplo: En el api CreateRequest el parámetro requerido ipAddress se podría cambiar para que fuera opcional.// CreateRequest body\n\n{\n  ...\n  \"payment\": { ... }\n  \"ipAddress\": \"1.0.0.0.1\" // changed to be optional\n  ...\n}\nEste cambio no afectará las integraciones existentes.No se podrá hacer lo contrario, es decir, un parámetro opcional no se podrá volver requerido. \n url: https://placetopay-docs.placetopay.ws/api-policy"
    },
    {
      "content": "title: Sesión \n Content: Se identifica como sesión, a la experiencia visual con el que interactuan los usuarios para completar un pago. \n url: https://placetopay-docs.placetopay.ws/api-reference/session"
    },
    {
      "content": "title: Crear una sesión \n Content: Este endpoint te permite crear una nueva sesión. En la sesión el usuario podrá completar un pago o suscripción.AtributosNamelocaleTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Definido con los códigos ISO 631-1 (language) y ISO 3166-1 alpha-2 (2-letras del país). ej. en_US, es_CO\nNameauthTypeAuthenticationis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura de autenticación api para sitios.Ver atributosNamepayerTypePersonis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura que refleja la información de una persona involucrada en una transacción.Ver atributosNamebuyerTypePersonis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura que refleja la información de una persona involucrada en una transacción.Ver atributosNamepaymentTypePaymentRequestis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura que contiene la información acerca del pago de la transacción requerida al servicio web.\nVer atributosNamesubscriptionTypeSubscriptionRequestis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura que contiene la información relacionada con una solicitud de suscripción para obtener un Token.\nVer atributosNamefieldsTypearrayis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Ver atributosNamepaymentMethodTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Forzar el medio de pago en la interfaz de redirección, los códigos aceptados son los de la lista. Si necesita más de uno separarlos con coma. ej. visa,amex,master\nNameexpirationTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Fecha de expiración de una solicitud, el usuario debe terminar el proceso antes de esta fecha.\nNamereturnUrlTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">URL de retorno es utilizada para redirigir al usuario una vez termina la operación de pago.\nNamecancelUrlTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">URL para retornar cuando el cliente aborte la operación.\nNameipAddressTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Dirección IP del usuario.\nNameuserAgentTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">NameskipResultTypebooleanis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Si se envía el parámetro como true se omite la pantalla del resultado en redirección y una vez aprobado el pago regresa al comercio automaticamente.\nNamenoBuyerFillTypebooleanis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Por defecto se llenan los datos que se piden en redirección con los del comprador (buyer) enviados, si se envía como true se omite este autocompletado automático.\nNametypeTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">crear una sesión de preautorizaciónSolicitudcurl -X \"POST\" https://checkout-test.placetopay.com/api/session \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\n      \"locale\": \"es_CO\",\n      \"auth\": {\n        \"login\":\"c51ce410c124a10e0db5e4b97fc2af39\",\n        \"tranKey\":\"VQOcRcVH2DfL6Y4B4SaK6yhoH/VOUveZ3xT16OQnvxE=\",\n        \"nonce\":\"NjE0OWVkODgwYjNhNw==\",\n        \"seed\":\"2021-09-21T09:34:48-05:00\"\n      },\n      \"payment\": {\n          \"reference\": \"1122334455\",\n          \"description\": \"Prueba\",\n          \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 100\n          }\n      },\n      \"expiration\": \"2021-12-30T00:00:00-05:00\",\n      \"returnUrl\": \"https://dnetix.co/p2p/client\",\n      \"ipAddress\": \"127.0.0.1\",\n      \"userAgent\": \"PlacetoPay Sandbox\"\n  }'\nRespuesta{\n  \"status\": {\n    \"status\": \"OK\",\n    \"reason\": \"PC\",\n    \"message\": \"La petición se ha procesado correctamente\",\n    \"date\": \"2021-11-30T15:08:27-05:00\"\n  },\n  \"requestId\": 1,\n  \"processUrl\": \"https://checkout-co.placetopay.com/session/1/cc9b8690b1f7228c78b759ce27d7e80a\",\n}\n \n url: https://placetopay-docs.placetopay.ws/api-reference/session"
    },
    {
      "content": "title: Consultar una sesión \n Content: Este endpoint te permite obtener la información de la sesión, si en la sesión hay transacciones se muestra el detalle de las mismas.AtributosNameauthTypeAuthenticationis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura de autenticación api para sitios.Ver atributosSolicitudcurl -X \"POST\" https://checkout-test.placetopay.com/api/session/000000 \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\n      \"auth\": {\n        \"login\": \"c51ce410c124a10e0db5e4b97fc2af39\",\n        \"tranKey\": \"VQOcRcVH2DfL6Y4B4SaK6yhoH/VOUveZ3xT16OQnvxE=\",\n        \"nonce\": \"NjE0OWVkODgwYjNhNw==\",\n        \"seed\": \"2021-09-21T09:34:48-05:00\"\n      }\n    }'\nRespuesta{\n  \"requestId\": 1,\n  \"status\": {\n    \"status\": \"APPROVED\",\n    \"reason\": \"00\",\n    \"message\": \"La petición ha sido aprobada exitosamente\",\n    \"date\": \"2022-07-27T14:51:27-05:00\"\n  },\n  \"request\": {\n    \"locale\": \"es_CO\",\n    \"payer\": {\n      \"document\": \"1122334455\",\n      \"documentType\": \"CC\",\n      \"name\": \"John\",\n      \"surname\": \"Doe\",\n      \"company\": \"Evertec\",\n      \"email\": \"johndoe@app.com\",\n      \"mobile\": \"+5731111111111\",\n      \"address\": {\n        \"street\": \"Calle falsa 123\",\n        \"city\": \"Medellín\",\n        \"state\": \"Poblado\",\n        \"postalCode\": \"55555\",\n        \"country\": \"Colombia\",\n        \"phone\": \"+573111111111\"\n      }\n    },\n    \"buyer\": {\n      \"document\": \"1122334455\",\n      \"documentType\": \"CC\",\n      \"name\": \"John\",\n      \"surname\": \"Doe\",\n      \"company\": \"Evertec\",\n      \"email\": \"johndoe@app.com\",\n      \"mobile\": \"+5731111111111\",\n      \"address\": {\n        \"street\": \"Calle falsa 123\",\n        \"city\": \"Medellín\",\n        \"state\": \"Poblado\",\n        \"postalCode\": \"55555\",\n        \"country\": \"Colombia\",\n        \"phone\": \"+573111111111\"\n      }\n    },\n    \"payment\": {\n      \"reference\": \"12345\",\n      \"description\": \"Prueba de pago\",\n      \"amount\": {\n        \"currency\": \"COP\",\n        \"total\": 2000,\n        \"taxes\": [\n          {\n            \"kind\": \"valueAddedTax\",\n            \"amount\": 1000,\n            \"base\": 0\n          }\n        ],\n        \"details\": [\n          {\n            \"kind\": \"discount\",\n            \"amount\": 1000\n          }\n        ]\n      },\n      \"allowPartial\": false,\n      \"shipping\": {\n        \"document\": \"1122334455\",\n        \"documentType\": \"CC\",\n        \"name\": \"John\",\n        \"surname\": \"Doe\",\n        \"company\": \"Evertec\",\n        \"email\": \"johndoe@app.com\",\n        \"mobile\": \"+5731111111111\",\n        \"address\": {\n          \"street\": \"Calle falsa 123\",\n          \"city\": \"Medellín\",\n          \"state\": \"Poblado\",\n          \"postalCode\": \"55555\",\n          \"country\": \"Colombia\",\n          \"phone\": \"+573111111111\"\n        }\n      },\n      \"items\": [\n        {\n          \"sku\": \"12345\",\n          \"name\": \"product_1\",\n          \"category\": \"physical\",\n          \"qty\": \"1\",\n          \"price\": 1000,\n          \"tax\": 0\n        }\n      ],\n      \"fields\": [\n        {\n          \"keyword\": \"_test_field_value_\",\n          \"value\": \"_test_field_\",\n          \"displayOn\": \"approved\"\n        }\n      ],\n      \"recurring\": {\n        \"periodicity\": \"D\",\n        \"interval\": \"1\",\n        \"nextPayment\": \"2019-08-24\",\n        \"maxPeriods\": 1,\n        \"dueDate \": \"2019-09-24\",\n        \"notificationUrl \": \"https://checkout.placetopay.com\"\n      },\n      \"subscribe\": false,\n      \"dispersion\": [\n        {\n          \"agreement\": \"1299\",\n          \"agreementType\": \"MERCHANT\",\n          \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 200\n          }\n        }\n      ],\n      \"modifiers\": [\n        {\n          \"type\": \"FEDERAL_GOVERNMENT\",\n          \"code\": 17934,\n          \"additional\": {\n            \"invoice\": \"123345\"\n          }\n        }\n      ]\n    },\n    \"subscription\": {\n      \"reference\": \"12345\",\n      \"description\": \"Ejemplo de descripción\",\n      \"fields\": {\n        \"keyword\": \"1111\",\n        \"value\": \"lastDigits\",\n        \"displayOn\": \"none\"\n      }\n    },\n    \"fields\": [\n      {\n        \"keyword\": \"_processUrl_\",\n        \"value\": \"https://checkout.redirection.test/session/1/a592098e22acc709ec7eb30fc0973060\",\n        \"displayOn\": \"none\"\n      }\n    ],\n    \"paymentMethod\": \"visa\",\n    \"expiration\": \"2019-08-24T14:15:22Z\",\n    \"returnUrl\": \"https://commerce.test/return\",\n    \"cancelUrl\": \"https://commerce.test/cancel\",\n    \"ipAddress\": \"127.0.0.1\",\n    \"userAgent\": \"PlacetoPay Sandbox\",\n    \"skipResult\": false,\n    \"noBuyerFill\": false,\n    \"type\": \"checkin\"\n  },\n  \"payment\": [\n    {\n      \"status\": {\n        \"status\": \"APPROVED\",\n        \"reason\": \"00\",\n        \"message\": \"La petición ha sido aprobada exitosamente\",\n        \"date\": \"2022-07-27T14:51:27-05:00\"\n      },\n      \"internalReference\": 12345,\n      \"reference\": \"12345\",\n      \"paymentMethod\": \"visa\",\n      \"paymentMethodName\": \"Visa\",\n      \"issuerName\": \"JPMORGAN CHASE BANK, N.A.\",\n      \"amount\": {\n        \"from\": {\n          \"currency \": \"COP\",\n          \"total \": 10000\n        },\n        \"to\": {\n          \"currency \": \"COP\",\n          \"total \": 10000\n        },\n        \"factor\": 1\n      },\n      \"receipt\": \"052617800175\",\n      \"franchise\": \"PS_VS\",\n      \"refunded\": false,\n      \"authorization\": \"965960\",\n      \"processorFields\": [\n        {\n          \"keyword\": \"1111\",\n          \"value\": \"lastDigits\",\n          \"displayOn\": \"none\"\n        }\n      ],\n      \"dispersion\": null,\n      \"agreement\": null,\n      \"agreementType\": null,\n      \"discount\": {\n        \"base\": 3000,\n        \"code\": \"17934\",\n        \"type\": \"FRANCHISE\",\n        \"amount\": 1000\n      },\n      \"subscription\": null\n    }\n  ],\n  \"subscription\": {\n    \"status\": {\n      \"status\": \"OK\",\n      \"reason\": \"00\",\n      \"message\": \"La petición ha sido aprobada exitosamente\",\n      \"date\": \"2022-07-27T14:51:27-05:00\"\n    },\n    \"type\": \"token\",\n    \"instrument\": [\n      {\n        \"keyword\": \"token\",\n        \"value\": \"a3bfc8e2afb9ac5583922eccd6d2061c1b0592b099f04e352a894f37ae51cf1a\",\n        \"displayOn\": \"none\"\n      },\n      {\n        \"keyword\": \"subtoken\",\n        \"value\": \"8740257204881111\",\n        \"displayOn\": \"none\"\n      },\n      {\n        \"keyword\": \"franchise\",\n        \"value\": \"visa\",\n        \"displayOn\": \"none\"\n      },\n      {\n        \"keyword\": \"franchiseName\",\n        \"value\": \"Visa\",\n        \"displayOn\": \"none\"\n      },\n      {\n        \"keyword\": \"issuerName\",\n        \"value\": \"JPMORGAN CHASE BANK, N.A.\",\n        \"displayOn\": \"none\"\n      },\n      {\n        \"keyword\": \"lastDigits\",\n        \"value\": \"1111\",\n        \"displayOn\": \"none\"\n      },\n      {\n        \"keyword\": \"validUntil\",\n        \"value\": \"2029-12-31\",\n        \"displayOn\": \"none\"\n      },\n      {\n        \"keyword\": \"installments\",\n        \"value\": null,\n        \"displayOn\": \"none\"\n      }\n    ]\n  }\n}\n \n url: https://placetopay-docs.placetopay.ws/api-reference/session"
    },
    {
      "content": "title: Pago \n Content: Se identifica como pago, a una transacción realizada por el usuario dentro de una sesión de pago. \n url: https://placetopay-docs.placetopay.ws/api-reference/payment"
    },
    {
      "content": "title: Reversar pago \n Content: Permite revertir un pago aprobado con el código de referencia interna internalReference.AtributosNameauthTypeAuthenticationis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura de autenticación api para sitios.Ver atributosNameinternalReferenceTypestring|numberis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Referencia interna de la transacción a reversar que se encuentra en el listado de transacciones del getRequestInformation (payment).\nSolicitudcurl -X \"POST\" https://checkout-test.placetopay.com/api/session/000000 \\\n-H \"Content-Type: application/json\" \\\n-d '{\n    \"auth\": {\n        \"login\": \"c51ce410c124a10e0db5e4b97fc2af39\",\n        \"tranKey\": \"VQOcRcVH2DfL6Y4B4SaK6yhoH/VOUveZ3xT16OQnvxE=\",\n        \"nonce\": \"NjE0OWVkODgwYjNhNw==\",\n        \"seed\": \"2021-09-21T09:34:48-05:00\"\n    },\n    \"internalReference\": 1\n}'\nRespuesta{\n    \"status\": {\n        \"status\": \"APPROVED\",\n        \"reason\": \"00\",\n        \"message\": \"Aprobada\",\n        \"date\": \"2021-12-07T16:01:19-05:00\"\n    },\n    \"payment\": {\n        \"status\": {\n        \"status\": \"APPROVED\",\n        \"reason\": \"00\",\n        \"message\": \"Aprobada\",\n        \"date\": \"2021-12-07T16:01:18-05:00\"\n        },\n        \"internalReference\": 1,\n        \"paymentMethod\": \"visa\",\n        \"paymentMethodName\": \"Visa\",\n        \"issuerName\": \"JPMORGAN CHASE BANK, N.A.\",\n        \"amount\": {\n        \"from\": {\n            \"currency\": \"USD\",\n            \"total\": 100\n        },\n        \"to\": {\n            \"currency\": \"USD\",\n            \"total\": 100\n        },\n        \"factor\": 1\n        },\n        \"authorization\": \"123456\",\n        \"reference\": \"12345\",\n        \"receipt\": \"230955511860\",\n        \"franchise\": \"PS_VS\",\n        \"refunded\": false,\n        \"processorFields\": [\n        {\n            \"keyword\": \"merchantCode\",\n            \"value\": \"1465675\",\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"terminalNumber\",\n            \"value\": \"00990099\",\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"credit\",\n            \"value\": {\n            \"code\": \"1\",\n            \"type\": \"00\",\n            \"groupCode\": \"C\",\n            \"installments\": 1\n            },\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"totalAmount\",\n            \"value\": 52,\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"interestAmount\",\n            \"value\": 0,\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"installmentAmount\",\n            \"value\": 0,\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"iceAmount\",\n            \"value\": 0,\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"bin\",\n            \"value\": \"411111\",\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"expiration\",\n            \"value\": \"1223\",\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"lastDigits\",\n            \"value\": \"1111\",\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"id\",\n            \"value\": \"a10fe0690cfe557283310ba90746e159\",\n            \"displayOn\": \"none\"\n        },\n        {\n            \"keyword\": \"b24\",\n            \"value\": \"00\",\n            \"displayOn\": \"none\"\n        }\n        ]\n    }\n}\n \n url: https://placetopay-docs.placetopay.ws/api-reference/payment"
    },
    {
      "content": "title: Acciones de transacción \n Content: Permite realizar operaciones básicas de preauthorización como checkout, reauthorization, (No aplica para Puerto Rico) por otro lado también permite revertir un pago aprobado con el código de referencia interna reverse.AtributosNameauthTypeAuthenticationis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura de autenticación api para sitios.Ver atributosNameinternalReferenceTypeintegeris RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">NameamountTypeAmountis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Ver atributosNameactionTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Solicitudcurl -X \"POST\" https://checkout-test.placetopay.com/api/transaction \\\n    -H \"Content-Type: application/json\" \\\n    -d \"{\n        \"auth\": {\n            \"login\": \"c51ce410c124a10e0db5e4b97fc2af39\",\n            \"tranKey\": \"VQOcRcVH2DfL6Y4B4SaK6yhoH/VOUveZ3xT16OQnvxE=\",\n            \"nonce\": \"NjE0OWVkODgwYjNhNw==\",\n            \"seed\": \"2021-09-21T09:34:48-05:00\"\n        },\n        \"internalReference\": 640,\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": \"500\"\n        },\n        \"action\": \"checkout\"\n    }\"\nRespuesta{\n    \"reference\": \"12345\",\n    \"description\": \"Prueba de pago\",\n    \"amount\": {\n        \"currency\": \"COP\",\n        \"total\": 2000,\n        \"taxes\": [\n        {\n            \"kind\": \"valueAddedTax\",\n            \"amount\": 1000,\n            \"base\": 0\n        }\n        ],\n        \"details\": [\n        {\n            \"kind\": \"discount\",\n            \"amount\": 1000\n        }\n        ]\n    },\n    \"allowPartial\": false,\n    \"shipping\": {\n        \"document\": \"1122334455\",\n        \"documentType\": \"CC\",\n        \"name\": \"John\",\n        \"surname\": \"Doe\",\n        \"company\": \"Evertec\",\n        \"email\": \"johndoe@app.com\",\n        \"mobile\": \"+5731111111111\",\n        \"address\": {\n        \"street\": \"Calle falsa 123\",\n        \"city\": \"Medellín\",\n        \"state\": \"Poblado\",\n        \"postalCode\": \"55555\",\n        \"country\": \"Colombia\",\n        \"phone\": \"+573111111111\"\n        }\n    },\n    \"items\": [\n        {\n        \"sku\": \"12345\",\n        \"name\": \"product_1\",\n        \"category\": \"physical\",\n        \"qty\": \"1\",\n        \"price\": 1000,\n        \"tax\": 0\n        }\n    ],\n    \"fields\": [\n        {\n        \"keyword\": \"_test_field_value_\",\n        \"value\": \"_test_field_\",\n        \"displayOn\": \"approved\"\n        }\n    ],\n    \"recurring\": {\n        \"periodicity\": \"D\",\n        \"interval\": \"1\",\n        \"nextPayment\": \"2019-08-24\",\n        \"maxPeriods\": 1,\n        \"dueDate \": \"2019-09-24\",\n        \"notificationUrl \": \"https://checkout.placetopay.com\"\n    },\n    \"subscribe\": false,\n    \"dispersion\": [\n        {\n        \"agreement\": \"1299\",\n        \"agreementType\": \"MERCHANT\",\n        \"amount\": {\n            \"currency\": \"USD\",\n            \"total\": 200\n        }\n        }\n    ],\n    \"modifiers\": [\n        {\n        \"type\": \"FEDERAL_GOVERNMENT\",\n        \"code\": 17934,\n        \"additional\": {\n            \"invoice\": \"123345\"\n        }\n        }\n    ]\n}\n \n url: https://placetopay-docs.placetopay.ws/api-reference/payment"
    },
    {
      "content": "title: Token \n Content: Se identifica como token, a la llave generada por un proceso de suscripción permitiendo generar cobros sin interacción del usuario. \n url: https://placetopay-docs.placetopay.ws/api-reference/token"
    },
    {
      "content": "title: Cobro usando token \n Content: Permite realizar cobros sin la intervención del usuario usando medios de pago previamente suscritos.AtributosNamelocaleTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">NameauthTypeAuthenticationis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura de autenticación api para sitios.Ver atributosNamepayerTypePersonis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura que refleja la información de una persona involucrada en una transacción.Ver atributosNamebuyerTypePersonis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura que refleja la información de una persona involucrada en una transacción.Ver atributosNamepaymentTypePaymentRequestis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura que contiene la información acerca del pago de la transacción requerida al servicio web.\nVer atributosNametypeTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">crear una sesión de preautorizaciónNameinstrumentTypeInstrumentis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura que contiene los detalles de un medio de pago suscrito.\nVer atributosNameexpirationTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">NamereturnUrlTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">NamecancelUrlTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">NameipAddressTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">NameuserAgentTypestringis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Solicitudcurl -X \"POST\" https://checkout-test.placetopay.com/api/collect \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\n    \"locale\": \"es_CO\",\n    \"auth\": {\n      \"login\": \"c51ce410c124a10e0db5e4b97fc2af39\",\n      \"tranKey\": \"VQOcRcVH2DfL6Y4B4SaK6yhoH/VOUveZ3xT16OQnvxE=\",\n      \"nonce\": \"NjE0OWVkODgwYjNhNw==\",\n      \"seed\": \"2021-09-21T09:34:48-05:00\"\n    },\n    \"payment\": {\n      \"reference\": \"1122334455\",\n      \"description\": \"Prueba\",\n      \"amount\": {\n        \"currency\": \"USD\",\n        \"total\": 100\n      }\n    },\n    \"instrument\": {\n      \"token\": {\n        \"token\": \"e07ca9986cf0ecac8a557fa11c07bf37ea35e9e3e3a4180c49\"\n      }\n    },\n    \"expiration\": \"2021-12-30T00:00:00-05:00\",\n    \"returnUrl\": \"https://dnetix.co/p2p/client\",\n    \"ipAddress\": \"127.0.0.1\",\n    \"userAgent\": \"PlacetoPay Sandbox\"\n  }'\nRespuesta{\n  \"reference\": \"12345\",\n  \"description\": \"Prueba de pago\",\n  \"amount\": {\n    \"currency\": \"COP\",\n    \"total\": 2000,\n    \"taxes\": [\n      {\n        \"kind\": \"valueAddedTax\",\n        \"amount\": 1000,\n        \"base\": 0\n      }\n    ],\n    \"details\": [\n      {\n        \"kind\": \"discount\",\n        \"amount\": 1000\n      }\n    ]\n  },\n  \"allowPartial\": false,\n  \"shipping\": {\n    \"document\": \"1122334455\",\n    \"documentType\": \"CC\",\n    \"name\": \"John\",\n    \"surname\": \"Doe\",\n    \"company\": \"Evertec\",\n    \"email\": \"johndoe@app.com\",\n    \"mobile\": \"+5731111111111\",\n    \"address\": {\n      \"street\": \"Calle falsa 123\",\n      \"city\": \"Medellín\",\n      \"state\": \"Poblado\",\n      \"postalCode\": \"55555\",\n      \"country\": \"Colombia\",\n      \"phone\": \"+573111111111\"\n    }\n  },\n  \"items\": [\n    {\n      \"sku\": \"12345\",\n      \"name\": \"product_1\",\n      \"category\": \"physical\",\n      \"qty\": \"1\",\n      \"price\": 1000,\n      \"tax\": 0\n    }\n  ],\n  \"fields\": [\n    {\n      \"keyword\": \"_test_field_value_\",\n      \"value\": \"_test_field_\",\n      \"displayOn\": \"approved\"\n    }\n  ],\n  \"recurring\": {\n    \"periodicity\": \"D\",\n    \"interval\": \"1\",\n    \"nextPayment\": \"2019-08-24\",\n    \"maxPeriods\": 1,\n    \"dueDate \": \"2019-09-24\",\n    \"notificationUrl \": \"https://checkout.placetopay.com\"\n  },\n  \"subscribe\": false,\n  \"dispersion\": [\n    {\n      \"agreement\": \"1299\",\n      \"agreementType\": \"MERCHANT\",\n      \"amount\": {\n        \"currency\": \"USD\",\n        \"total\": 200\n      }\n    }\n  ],\n  \"modifiers\": [\n    {\n      \"type\": \"FEDERAL_GOVERNMENT\",\n      \"code\": 17934,\n      \"additional\": {\n        \"invoice\": \"123345\"\n      }\n    }\n  ]\n}\n \n url: https://placetopay-docs.placetopay.ws/api-reference/token"
    },
    {
      "content": "title: Invalidar Token \n Content: Permite invalidar un token ya existente del sitio. Esto hará que el token o el subtoken ya no se pueda usar.AtributosNameauthTypeAuthenticationis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Estructura de autenticación api para sitios.Ver atributosNamelocaleTypeLocaleis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Combinación de Idioma y País para definir el \"Idioma\" en el que se tratará la petición. \"en_US\", \"es_CO\"NameinstrumentTypeobjectis RequiredREQUIREDDescription:first-child]:mt-0 [&>:last-child]:mb-0\">Ver atributosSolicitudcurl -X \"POST\" https://checkout-test.placetopay.com/api/instrument/invalidate \\\n  -H 'Content-Type: application/json' \\\n  -d '{\n    \"auth\": {\n      \"auth\": {\n        \"login\": \"c51ce410c124a10e0db5e4b97fc2af39\",\n        \"tranKey\": \"VQOcRcVH2DfL6Y4B4SaK6yhoH/VOUveZ3xT16OQnvxE=\",\n        \"nonce\": \"NjE0OWVkODgwYjNhNw==\",\n        \"seed\": \"2021-09-21T09:34:48-05:00\"\n      }\n    },\n    \"locale\": \"en_US\",\n    \"instrument\": {\n      \"token\": {\n        \"token\": \"a3bfc8e2afb9ac5583922eccd6d2061c1b0592b099f04e352a894f37ae51cf1a\"\n      }\n    }\n  }'\nRespuesta{\n  \"status\": {\n    \"status\": \"APPROVED\",\n    \"reason\": \"00\",\n    \"message\": \"La petición ha sido aprobada exitosamente\",\n    \"date\": \"2022-07-27T14:51:27-05:00\"\n  }\n}\n \n url: https://placetopay-docs.placetopay.ws/api-reference/token"
    }
  ]
}